/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "新規アルバム作成中にエラーが発生しました。インターネット接続を確認して、再度行ってください。";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "Picasa ウェブアルバムにイメージをアップロード中にエラーが発生しました。インターネット接続を確認して、もう一度行ってください。";

/* Could not create a new album */
"Could not create a new album" = "新規アルバムを作成できませんでした";

/* Could not upload an image */
"Could not upload an image" = "イメージをアップロードできませんでした";
